# <center>  Naive Bayes implementation for titanic dataset </center>

## Import Libraries

In [1]:
import pandas as pd

## Import Dataset

In [2]:
train=pd.read_csv('train.csv')
test=pd.read_csv('test.csv')

## Data pre-processing

In [3]:
sex={"male":0,"female":1}
train.Sex=[sex[item] for item in train.Sex]
test.Sex=[sex[item] for item in test.Sex]

Filling null values by taking mean of whole data

In [4]:
train.Age.fillna(train.Age.mean(), inplace=True)
test.Age.fillna(test.Age.mean(), inplace=True)

train.Fare.fillna(train.Fare.mean(), inplace=True)
test.Fare.fillna(test.Fare.mean(), inplace=True)

dtype conversion

In [5]:
train.Age = train.Age.astype(int)
test.Age = test.Age.astype(int)

train.Fare = round(train.Fare)
test.Fare = round(test.Fare)

train.Fare = train.Fare.astype(int)
test.Fare = test.Fare.astype(int)

##### Ages grouped
Ages are grouped on basis of the range.

In [6]:
data = [train,test]
for i in data:
    i.loc[ i['Age'] <= 11, 'Age'] = 0
    i.loc[(i['Age'] > 11) & (i['Age'] <= 18), 'Age'] = 1
    i.loc[(i['Age'] > 18) & (i['Age'] <= 22), 'Age'] = 2
    i.loc[(i['Age'] > 22) & (i['Age'] <= 27), 'Age'] = 3
    i.loc[(i['Age'] > 27) & (i['Age'] <= 33), 'Age'] = 4
    i.loc[(i['Age'] > 33) & (i['Age'] <= 40), 'Age'] = 5
    i.loc[(i['Age'] > 40) & (i['Age'] <= 66), 'Age'] = 6
    i.loc[ i['Age'] > 66, 'Age'] = 7

In [7]:
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,2,1,0,A/5 21171,7,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,5,1,0,PC 17599,71,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,3,0,0,STON/O2. 3101282,8,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,5,1,0,113803,53,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,5,0,0,373450,8,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",0,3,0,0,211536,13,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",1,2,0,0,112053,30,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,4,1,2,W./C. 6607,23,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",0,3,0,0,111369,30,C148,C
890,891,0,3,"Dooley, Mr. Patrick",0,4,0,0,370376,8,NaN,Q

##### Fare grouped
Fare are grouped on basis of the range.

In [8]:
data = [train,test]
for i in data:
    i.loc[ i['Fare'] <= 11, 'Fare'] = 0
    i.loc[(i['Fare'] > 11) & (i['Fare'] <= 21), 'Fare'] = 1
    i.loc[(i['Fare'] > 21) & (i['Fare'] <= 31), 'Fare'] = 2
    i.loc[(i['Fare'] > 31) & (i['Fare'] <= 41), 'Fare'] = 3
    i.loc[(i['Fare'] > 41) & (i['Fare'] <= 51), 'Fare'] = 4
    i.loc[(i['Fare'] > 51) & (i['Fare'] <= 61), 'Fare'] = 5
    i.loc[(i['Fare'] > 61) & (i['Fare'] <= 71), 'Fare'] = 6
    i.loc[ i['Fare'] > 71, 'Fare'] = 7

In [9]:
train.head(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,2,1,0,A/5 21171,0,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,5,1,0,PC 17599,6,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,3,0,0,STON/O2. 3101282,0,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,5,1,0,113803,5,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,5,0,0,373450,0,NaN,S
5,6,0,3,"Moran, Mr. James",0,4,0,0,330877,0,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",0,6,0,0,17463,5,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",0,0,3,1,349909,1,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,3,0,2,347742,0,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,1,1,0,237736,2,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",1,0,1,1,PP 9549,1,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",1,6,0,0,113783,2,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",0,2,0,0,A/5. 2151,0,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",0,5,1,5,347082,2,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",1,1,0,0,350406,0,NaN,S

In [10]:
train.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)
train.head()

   Survived  Pclass  Sex  Age  Fare
0         0       3    0    2     0
1         1       1    1    5     6
2         1       3    1    3     0
3         1       1    1    5     5
4         0       3    0    5     0

In [11]:
test.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)
test.head()

   Pclass  Sex  Age  Fare
0       3    0    5     0
1       3    1    6     0
2       2    0    6     0
3       3    0    3     0
4       3    1    2     1

##### Probabilities of the features.

In [12]:
Class_counts = train['Pclass'].value_counts()  
prob_Class = Class_counts/len(train)

Age_counts = train['Age'].value_counts()
prob_Age = Age_counts/len(train)

Sex_counts = train['Sex'].value_counts()
prob_Sex = Sex_counts/len(train)

Fare_counts = train['Fare'].value_counts()
prob_Fare = Fare_counts/len(train)

##### Survival and Death probabilities

In [13]:
y_counts = train['Survived'].value_counts()
p_y = y_counts/len(train)

Survived = train.loc[train['Survived'] == 1]
Died = train.loc[train['Survived'] == 0]

###  Conditional probabilities

##### class/survived & class/died

In [14]:
class_survived_counts = Survived['Pclass'].value_counts()  
prob_Class_survived = class_survived_counts/len(Survived)

class_died_counts = Died['Pclass'].value_counts()  
prob_Class_died = class_died_counts/len(Died)

##### sex/survived & Age/died

In [15]:
sex_survived_counts = Survived['Sex'].value_counts()  
prob_Sex_survived = sex_survived_counts/len(Survived)

sex_died_counts = Died['Sex'].value_counts()  
prob_Sex_died = sex_died_counts/len(Died)

##### Age/survived & Age/died

In [16]:
age_survived_counts = Survived['Age'].value_counts()  
prob_Age_survived = age_survived_counts/len(Survived)

age_died_counts = Died['Age'].value_counts()  
prob_Age_died = age_died_counts/len(Died)

##### Fare/survived & Fare/died

In [17]:
Fare_survived_counts = Survived['Fare'].value_counts()  
prob_Fare_survived = Fare_survived_counts/len(Survived)

Fare_died_counts = Died['Fare'].value_counts()  
prob_Fare_died = Fare_died_counts/len(Died)

In [18]:
def NaiveBayes(py,prob_X1_Y,prob_X2_Y,prob_X3_Y,prob_X4_Y,prob_X1,prob_X2,prob_X3,prob_X4):
    
    numerator=(prob_X1_Y)*(prob_X2_Y)*(prob_X3_Y)*(prob_X4_Y)*(py)
    denominator=(prob_X1)*(prob_X2)*(prob_X3)*(prob_X4)
    
    p = numerator/denominator
    return p

result_=[]
len(test)

for i in range(0,len(test)):
    feature_class=test.iloc[i]['Pclass']
    feature_sex=test.iloc[i]['Sex']
    feature_age=test.iloc[i]['Age']
    feature_Fare=test.iloc[i]['Fare']

    
    Probability_Y1=NaiveBayes(p_y[1],prob_Class_survived[feature_class],prob_Sex_survived[feature_sex],prob_Age_survived[feature_age],prob_Fare_survived[feature_Fare],prob_Class[feature_class],prob_Sex[feature_sex],prob_Age[feature_age],prob_Fare[feature_Fare])
    Probability_Y0=NaiveBayes(p_y[0],prob_Class_died[feature_class],prob_Sex_died[feature_sex],prob_Age_died[feature_age],prob_Fare_died[feature_Fare],prob_Class[feature_class],prob_Sex[feature_sex],prob_Age[feature_age],prob_Fare[feature_Fare])
    
    if Probability_Y0 > Probability_Y1:
        result=0
    else:
        result=1
        
    result_.append(result)

In [19]:
Y_test = pd.read_csv('gender_submission.csv')
Y_test = Y_test.iloc[:,-1].values

In [20]:
from sklearn.metrics import accuracy_score

accuracy = accuracy_score(Y_test, result_)
print("Accuracy:", accuracy)

Accuracy: 0.8229665071770335